# 01. Importing Libraries

In [1]:
# Import Libraries

In [2]:
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [3]:
# Import df_ords (orders.csv) and df_prods (products.csv)

In [4]:
path = r'C:\Users\Marce\careerfoundry\Instacart Basket Analysis'

In [5]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'))

In [6]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))

## End of Importing Data

# 03. Breadcrumbs of 4.5

In [7]:
# Create a Dataframe

df_test=pd.DataFrame()

In [8]:
# Create a mixed type column

df_test['mix'] = ['a','b',1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [10]:
# checking whether a dataframe contains any mixed-type columns
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [11]:
df_test['mix'] = df_test['mix'].astype('str')

In [12]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [15]:
df_prods.shape

(49693, 5)

In [16]:
df_prods_clean = df_prods[df_prods['product_name'].isnull()==False]

In [17]:
df_prods_clean.shape

(49677, 5)

In [18]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [19]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [20]:
df_prods_clean.shape

(49677, 5)

In [21]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [22]:
df_prods_clean_no_dups.shape

(49672, 5)

# DF_ORDS

## Task 3

In [23]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

### print wasn't triggered -> no mix-type columns

## Task 5

In [24]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [25]:
df_ords_nulls=df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [26]:
df_ords_nulls

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [27]:
df_ords_nulls[df_ords_nulls['order_number']==1]

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

#### Answer: Missing value for first orders, because "infinity" is no value/can't be shown and zero is reserved to consecutive orders

## Task 6

#### Imputation=not an option /// Removing or Filtering=not an option /// Only reasonable option would be flagging
#### I decided to replace missing values with the string "first_order" so it's directly clear it can't have any value in "days_since_prior_order"

In [28]:
df_ords_nulls=df_ords_nulls.replace(np.nan, 'first_order', regex=True)

In [29]:
df_ords_nulls

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,first_order
11,2168274,2,prior,1,2,11,first_order
26,1374495,3,prior,1,1,14,first_order
39,3343014,4,prior,1,6,11,first_order
45,2717275,5,prior,1,3,12,first_order
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,first_order
3420934,3189322,206206,prior,1,3,18,first_order
3421002,2166133,206207,prior,1,6,19,first_order
3421019,2227043,206208,prior,1,1,15,first_order
3421069,3154581,206209,prior,1,3,11,first_order

## Task 7

In [30]:
df_ords_dups=df_ords[df_ords.duplicated()]

#### no duplicates found

In [31]:
##df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

# End of 4.5

In [ ]:
# code for cleaning from 4.9
# ords_prods_merge.loc[ords_prods_merge['prices'] >100, 'prices'] = np.nan